<a href="https://colab.research.google.com/github/EliasGabriel1/ProjetoUmBrasilMelhor/blob/main/BasicoPandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
#Nesse notbook, quero mostrar o básico de lógica com o pandas, antes de tudo vamos chamar a labrary do pandas, assim:
import pandas as pd
# e também a do numpy, aonde vamos chamar a library do numpy, que vamos criar os arrays do data frame
import numpy as np

#para quem não conhece nada de python será complicado entender esse notbook por mais que seja bem explicativo, tem que saber o minimo de python,
#mas de forma simples, sempre chamamos as bibliotecas com o import library mais o seu nome abreviado (as np, as pd, as plt, as sns entre outros)

In [4]:
#Como falado, vamos usar o numpy para criar arrays para o df, comassim? quando formos fazer as analises de csv ou Data Frames, será chamado as df
#df=pd.read_csv(src entre aspas, encoding e as vezes é necessário por a separação assim: sep:',' or sep:'|')
#desta forma: df = pd.read_csv('namecsv.csv', delimiter=';'(ou pode usar o sep='',), encoding='iso-8859-1)
#podendo ser encoding='latin1' or encoding='cp1252' .

In [14]:
#aqui então vamos criar o array pelo numpy, sempre chamando o numpy pelo apelido(np), colocamos o nome do array de data, assim passamos os valores 
#do pais, cidade e valor da população respectivamente, antes de dar nomes as colunas e do index.
#poderia ser um array menor mas não muda a logica, assim: data =np.array([['Portugal', 'Lisboa', 10000000], ['Peru', 'Lima', 32000000]]), porém 
#pra ter mais dados no df, eu fiz um array de 8 linhas
data =np.array([['Portugal', 'Lisboa', 10000000], ['Peru', 'Lima', 32000000],['Chile', 'Santiago', 18000000],['Brasil', 'Brasília', 209000000],
                ['França', 'Paris', 77000000], ['USA', 'Washington, D.C.', 328000000],['Japão', 'Tóquio', 126000000],['coreia', 'Seul', 51640000]])

In [78]:
#se perceber, tem muitos arquivos e APIs que possui dados nessa forma, semelhante ou do tipo json, como esse dataframe usado no meu outro 
#notbook: http://bit.ly/chiporders
data

array([['Portugal', 'Lisboa', '10000000'],
       ['Peru', 'Lima', '32000000'],
       ['Chile', 'Santiago', '18000000'],
       ['Brasil', 'Brasília', '209000000'],
       ['França', 'Paris', '77000000'],
       ['USA', 'Washington, D.C.', '328000000'],
       ['Japão', 'Tóquio', '126000000'],
       ['coreia', 'Seul', '51640000']], dtype='<U16')

In [19]:
#aqui então criamos o data frame pelo PANDAS, chamando o array feito acima com o NUMPY, colocando o número da linha
#(index, range qualquer nome do tipo podemos dar a isso ai), e o nomes das colunas respectivamente assim:
df = pd.DataFrame(data, index=range(100,108),columns=['País', 'Capital', 'População'])

In [20]:
#Exibimos o DF(DataFrame)
df

         País           Capital  População
100  Portugal            Lisboa   10000000
101      Peru              Lima   32000000
102     Chile          Santiago   18000000
103    Brasil          Brasília  209000000
104    França             Paris   77000000
105       USA  Washington, D.C.  328000000
106     Japão            Tóquio  126000000
107    coreia              Seul   51640000

In [21]:
#podemos já ir acostumando ao comando head, que mostra os primeiros números de uma data frame, assim:
df.head(5)
#mostrando os 5 primeiros valores da df

         País   Capital  População
100  Portugal    Lisboa   10000000
101      Peru      Lima   32000000
102     Chile  Santiago   18000000
103    Brasil  Brasília  209000000
104    França     Paris   77000000

In [24]:
#Tratando com suposição, veio uma vontade de mudar o nome da coluna população para qtd(quantidade de pessoas), primeiro vou ver todos os nomes das colunas
#nesse caso é simples pois existe apenas 3 colunas, porém pode haver DataFrames com uma quantidade grande de colunas, ai precisamos dar comando de columns para
#saber os nomes, assim:
df.columns

Index(['País', 'Capital', 'População'], dtype='object')

In [35]:
#Aqui então iremos trocar os nomes das colunas, e sempre seguindo o padrão de aspas *SIMPLES*, se não irá dar erro.
df.rename(columns={'País':'País', 'Capital':'Capital', 'População':'qtd'})

         País           Capital        qtd
100  Portugal            Lisboa   10000000
101      Peru              Lima   32000000
102     Chile          Santiago   18000000
103    Brasil          Brasília  209000000
104    França             Paris   77000000
105       USA  Washington, D.C.  328000000
106     Japão            Tóquio  126000000
107    coreia              Seul   51640000

In [36]:
#pronto agora pra confirmar a mudança do titulo da coluna
df.head(5)

         País   Capital        qtd
100  Portugal    Lisboa   10000000
101      Peru      Lima   32000000
102     Chile  Santiago   18000000
103    Brasil  Brasília  209000000
104    França     Paris   77000000

In [30]:
#Quando precisamos fazer mudanças que pode auterar resultados na hora da plotagem, podemos fazer o comando copy, para novas df
#assim:
df_1=df.copy()

In [32]:
#compravando se o data frame foi copiado:
df_1

         País           Capital        qtd
100  Portugal            Lisboa   10000000
101      Peru              Lima   32000000
102     Chile          Santiago   18000000
103    Brasil          Brasília  209000000
104    França             Paris   77000000
105       USA  Washington, D.C.  328000000
106     Japão            Tóquio  126000000
107    coreia              Seul   51640000

In [33]:
#Sempre da mesma forma, passando o pd.DataFrame(valores, como neste exemplo o array foi criado na hora, e colunas=[nomes das colunas SEMPRE separados por 
#aspas SIMPLES]), podendo para melhor análise catalogar por números as linhas, ou adicionar o parametro inplance=True, para pegar apenas os dados
#Com valores reais, sem valores none, Nan ou null
#Podemos também criar df por array do numpy ja imbutidos, assim:
df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                   columns=['a', 'b', 'c'])

In [34]:
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [64]:
#Trabalhando com valores NA e NONE
#Dados que muitos df possui valores como NaN ou none, precisamos ver as colunas e linhas com todos os valores
#Podemos fazer desta forma(passando os nomes das colunas e os valores):
client_dictionary = {'name': ['Michael', 'Ana', 'Sean', 'Carl', 'Bob'], 
                     'second name': [None, 'Angel', 'Ben', 'Frank', 'Daniel'],
                     'birth place': ['New York', 'New York', 'Los Angeles', 'New York', 'New York'],
                     'age': [10, 35, 56, None, 28],
                     'number of children': [0, None, 2, 1, 1]}
df = pd.DataFrame(client_dictionary)
df.head(5)

      name second name  birth place   age  number of children
0  Michael        None     New York  10.0                 0.0
1      Ana       Angel     New York  35.0                 NaN
2     Sean         Ben  Los Angeles  56.0                 2.0
3     Carl       Frank     New York   NaN                 1.0
4      Bob      Daniel     New York  28.0                 1.0

In [65]:
#Como falado, não queremos mexer no dataframe principal, então faremos duas copias dele, para brincarmos durantes a compilação, assim:
dataf=df.copy()
dataf2=df.copy()
dataf

      name second name  birth place   age  number of children
0  Michael        None     New York  10.0                 0.0
1      Ana       Angel     New York  35.0                 NaN
2     Sean         Ben  Los Angeles  56.0                 2.0
3     Carl       Frank     New York   NaN                 1.0
4      Bob      Daniel     New York  28.0                 1.0

In [66]:
#Tiraremos todas as linhas ausentes com valores ausentes, assim:
dataf.dropna(inplace=True)
dataf.head(10)

   name second name  birth place   age  number of children
2  Sean         Ben  Los Angeles  56.0                 2.0
4   Bob      Daniel     New York  28.0                 1.0

In [67]:
#Ou como falado, em df grandes, damos o head, assim:
dataf.head(10)

   name second name  birth place   age  number of children
2  Sean         Ben  Los Angeles  56.0                 2.0
4   Bob      Daniel     New York  28.0                 1.0

In [68]:
#Agora faremos o contrario, tiraremos as linhas que possui todos valores
dataf2.dropna(inplace=False)
dataf2.head(10)

      name second name  birth place   age  number of children
0  Michael        None     New York  10.0                 0.0
1      Ana       Angel     New York  35.0                 NaN
2     Sean         Ben  Los Angeles  56.0                 2.0
3     Carl       Frank     New York   NaN                 1.0
4      Bob      Daniel     New York  28.0                 1.0

In [69]:
#Mas e se eu quero todos os nomes que tem sobrenomes, que falou a cidade e a idade mas não falou o numero de filhos?
#Num caso expecial eu só quero saber as pessoas que falaram idependente de nome, sobrenome
#Assim:
dataf.dropna(inplace=True, subset=['second name', 'age'])
dataf.head()

   name second name  birth place   age  number of children
2  Sean         Ben  Los Angeles  56.0                 2.0
4   Bob      Daniel     New York  28.0                 1.0

In [70]:
#Para terminar, vamos deixar todas colunas em portuga?
#Primeiro vamos ver os nomes dos valores das colunas:
dataf.columns

Index(['name', 'second name', 'birth place', 'age', 'number of children'], dtype='object')

In [79]:
#Depois de ver os nomes das colunas, vamos por para portugues com a função rename, assim:
dataf.rename(columns={'name':'nome','second name':'segundo nome', 'birth place':'lugar de nascimento', 
                      'age':'idade', 'number of children':'números de filhos'})

   nome segundo nome lugar de nascimento  idade  números de filhos ativo
2  Sean          Ben         Los Angeles   56.0                2.0   sim
4   Bob       Daniel            New York   28.0                1.0   sim

In [80]:
#O .loc pode fazer muitas coisas no pandas, umas delas é adicionar colunas, assim:
dataf.loc[:,'ativo']='sim'

In [81]:
#Aqui podemos perceber que toda alteração desde tirar todos dados ausentes já são gravados a cada mudança
dataf.head()

   name second name  birth place   age  number of children ativo
2  Sean         Ben  Los Angeles  56.0                 2.0   sim
4   Bob      Daniel     New York  28.0                 1.0   sim

In [85]:
#Como ultimo caso, tem um dataframe usado em algumas aulas de datascience no youtube,
#Irei mostrar um problema simples que sempre acontece, o dataframe apresenta separação por tabulação, sem coluna, então temos que por os nomes assim:
col_names = ['Id','Age', 'Gender', 'Occupation', 'Salary']
#e fazer todo processo falado, passar os array ou valores, falando qual a separação e os nomes das colunas
#Como ja fizemos uma váriavel com os nomes das colunas, só iremos passar a váriavel para a data frame, assim:
data = pd.read_table('http://bit.ly/movieusers', sep='|', header = None, names=col_names)

In [86]:
data.head()

   Id  Age Gender  Occupation Salary
0   1   24      M  technician  85711
1   2   53      F       other  94043
2   3   23      M      writer  32067
3   4   24      M  technician  43537
4   5   33      F       other  15213